In [6]:
import pandas as pd
from env import host, user, password

In [9]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and 
# return a url connection string formatted like in the example at the start of this lesson.

def get_db_url(user, host, password, dbname):
    return f'mysql+pymysql://{user}:{password}@{host}/{dbname}'

In [10]:
get_db_url('easley08', '234.354.907.897', 'not_very_secure', 'chipotle')

'mysql+pymysql://easley08:not_very_secure@234.354.907.897/chipotle'

In [11]:
# Use your function to obtain a connection to the employees database.
url = get_db_url(user, host, password, 'employees')

In [12]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [13]:
# Read the employees and titles tables into two separate DataFrames.
employees_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * FROM titles', url)

In [15]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?
employees_df.shape

(300024, 6)

In [16]:
titles_df.shape

(443308, 4)

In [17]:
# Display the summary statistics for each DataFrame.
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [18]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [22]:
# How many unique titles are in the titles DataFrame?
pd.read_sql('SELECT DISTINCT title FROM titles', url).shape[0]

7

In [23]:
# What is the oldest date in the to_date column?
pd.read_sql('SELECT to_date FROM titles ORDER BY to_date ASC LIMIT 1', url)

      to_date
0  1985-03-01

In [26]:
# What is the most recent date in the to_date column?
pd.read_sql('SELECT max(to_date) FROM titles WHERE to_date NOT LIKE "%9999%"', url)

  max(to_date)
0   2002-08-01